{
    "CAN Adapter": "Adaptador CAN",
    "Please start this adapter instance to enable further configuration options.": "Inicie esta instancia de adaptador para habilitar más opciones de configuración.",
    "Please press button 'Save', when you're done on this tab.": "Presione el botón 'Guardar' cuando haya terminado en esta pestaña.",
    "External CAN Adapter": "Adaptador CAN externo",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Nombre del dispositivo del adaptador CAN conectado al bus externo, p. can0",
    "Connect to Adapter": "Conectar al adaptador",
    "Internal CAN Adapter": "Adaptador CAN interno",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Nombre del dispositivo del adaptador CAN conectado al bus interno, p.e. can1",
    "List of UDS devices": "Lista de dispositivos UDS",
    "List of available devices": "Lista de dispositivos disponibles",
    "Configuration requires a running adapter instance!": "¡La configuración requiere una instancia de adaptador en ejecución!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Puede editar la segunda columna para establecer el nombre del estado del dispositivo (visible en el árbol de objetos).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "El análisis del dispositivo UDS está en curso. Esto puede tardar hasta 20 segundos.",
    "'Device state name' must not be blank!": "¡El 'nombre del estado del dispositivo' no debe estar en blanco!",
    "Symbol '.' not allowed in 'Device state name'": "Símbolo '.' no permitido en 'Nombre de estado del dispositivo'",
    "Device name (Viessmann)": "Nombre del dispositivo (Viessmann)",
    "Device state name": "Nombre del estado del dispositivo",
    "Device ECU name (fixed)": "Nombre de la ECU del dispositivo (fijo)",
    "Device Address": "Dirección del dispositivo",
    "Device ECU address (fixed)": "Dirección de la ECU del dispositivo (fija)",
    "CAN id for collecting data": "ID CAN para recopilar datos",
    "CAN id - still experimental. Leave blank for deactivation.": "Identificación de CAN: todavía experimental. Déjelo en blanco para su desactivación.",
    "List of datapoints": "Lista de puntos de datos",
    "Start scan for datapoints of all devices": "Iniciar escaneo en busca de puntos de datos de todos los dispositivos",
    "Confirm scan for datapoints": "Confirmar escaneo en busca de puntos de datos",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "El escaneo tardará hasta 5 minutos. Asegúrese de que no se esté ejecutando ningún otro cliente UDSonCAN (por ejemplo, Open3Eclient.py). No cierre la pestaña durante el escaneo. Puede seguir el progreso viendo el Registro en una pestaña adicional.",
    "OK": "DE ACUERDO",
    "Cancel": "Cancelar",
    "Select device": "Seleccione el dispositivo",
    "List of device specific datapoints": "Lista de puntos de datos específicos del dispositivo",
    "ID": "IDENTIFICACIÓN",
    "Id of datapoint": "ID del punto de datos",
    "Length": "Longitud",
    "Length of datapoint": "Longitud del punto de datos",
    "Name": "Nombre",
    "Name of datapoint": "Nombre del punto de datos",
    "Codec": "Códec",
    "Codec used for datapoint": "Códec utilizado para el punto de datos",
    "Assignments to External CAN Adapter": "Asignaciones al adaptador CAN externo",
    "Energy Meter E380": "Medidor de energía E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "ADVERTENCIA: ¡Los valores inferiores a 2 segundos pueden provocar una carga pesada del sistema!",
    "Activate communication": "Activar la comunicación.",
    "This text will be used as base for object tree": "Este texto se utilizará como base para el árbol de objetos.",
    "Min. update time (s)": "Mín. tiempo de actualización (s)",
    "Minumum update time for states. 0 for immediate update.": "Tiempo mínimo de actualización para los estados. 0 para actualización inmediata.",
    "Collecting Data on External CAN Adapter": "Recopilación de datos en un adaptador CAN externo",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Escuche los datos sobre las direcciones que figuran en esta tabla. No se puede escribir en el bus CAN. Presione '+' para comenzar.",
    "No device for collecting available (missing CAN ID).": "No hay ningún dispositivo de recogida disponible (falta CAN ID).",
    "ERROR: column 'Device state name' must contain unique text.": "ERROR: la columna 'Nombre de estado del dispositivo' debe contener texto único.",
    "active": "activo",
    "Requesting data on external CAN Adapter via UDSonCAN": "Solicitud de datos sobre adaptador CAN externo vía UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Especifique horarios para dispositivos, presione '+' para comenzar.",
    "Schedule (s)": "Horario(s)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Calendario para solicitar puntos de datos determinados. 0 para una solicitud única al inicio de la instancia del adaptador.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "¡Separe por coma! Todos los puntos de datos proporcionados se solicitarán con el cronograma especificado y la dirección de la ECU.",
    "Assignments to Internal CAN Adapter": "Asignaciones al adaptador CAN interno",
    "Collecting Data on Internal CAN Adapter": "Recopilación de datos en el adaptador CAN interno",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Escuche los datos sobre las direcciones que figuran en esta tabla. No se puede escribir en el bus CAN.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Dispositivos para la recogida de datos. No se puede escribir en el bus CAN. Presione '+' para agregar el dispositivo.",
    "Update list of datapoints": "Actualizar lista de puntos de datos",
    "Start scan to update list of devices": "Iniciar escaneo para actualizar la lista de dispositivos",
    "Description": "Descripción",
    "Optional description of this schedule.": "Descripción opcional de este horario.",
    "Energy Meters": "Medidores de energía",
    "UDS CAN Adapter": "Adaptador UDS CAN",
    "Device mame of CAN adapter connected to UDS-capable bus, e.g. can0": "Nombre del dispositivo del adaptador CAN conectado a un bus compatible con UDS, p. can0",
    "Assignments to UDS CAN Adapter": "Asignaciones al Adaptador UDS CAN",
    "Collecting Data on UDS CAN Adapter": "Recopilación de datos en el adaptador UDS CAN",
    "Requesting data on UDS CAN Adapter via UDSonCAN": "Solicitud de datos del Adaptador UDS CAN mediante UDSonCAN",
    "Second CAN Adapter": "Segundo adaptador CAN",
    "Device mame of CAN adapter connected to second bus, e.g. can1": "Nombre del dispositivo del adaptador CAN conectado al segundo bus, p. can1",
    "Assignments to second CAN Adapter": "Asignaciones al segundo adaptador CAN",
    "Collecting Data on second CAN Adapter": "Recopilación de datos en el segundo adaptador CAN"
}
