{
  "common": {
    "name": "e3oncan",
    "version": "0.9.5",
    "news": {
      "0.9.5": {
        "en": "Update of list of data points for E3 devices to version 20240916",
        "de": "Aktualisierung der Liste der Datenpunkte für E3 Geräte auf Version 20240916",
        "ru": "Обновление списка точек данных для устройств E3 к версии 20240916",
        "pt": "Atualização da lista de pontos de dados para dispositivos E3 para a versão 20240916",
        "nl": "Update van de lijst van gegevenspunten voor E3-apparaten naar versie 20240916",
        "fr": "Mise à jour de la liste des points de données pour les appareils E3 vers la version 20240916",
        "it": "Aggiornamento dell'elenco dei punti di dati per i dispositivi E3 alla versione 20240916",
        "es": "Actualización de la lista de puntos de datos para dispositivos E3 a la versión 20240916",
        "pl": "Aktualizacja wykazu punktów danych dla urządzeń E3 do wersji 20240916",
        "uk": "Оновлення списку точок даних для пристроїв E3 до версії 20240916",
        "zh-cn": "E3设备数据点列表更新至20240916版本"
      },
      "0.9.4": {
        "en": "Start up an UDS worker for each device to allow writing of data points even when no schedule for reading is defined on this device\nUpdate of npm dependencies",
        "de": "UDS-Worker für jedes Device starten, um das Schreiben von Datenpunkten zu ermöglichen, auch wenn auf einem Device keine Datenpunkte zum Lesen definiert sind\nAktualisierung von npm Abhängigkeiten",
        "ru": "Запустите работника UDS для каждого устройства, чтобы разрешить написание точек данных, даже если на этом устройстве не определяется график чтения\nОбновление зависимостей npm",
        "pt": "Inicie um trabalhador UDS para cada dispositivo para permitir a escrita de pontos de dados mesmo quando nenhum cronograma para leitura é definido neste dispositivo\nAtualização de dependências npm",
        "nl": "Opstarten van een UDS-werknemer voor elk apparaat om het schrijven van gegevenspunten mogelijk te maken, zelfs wanneer geen schema voor het lezen is gedefinieerd op dit apparaat\nBijwerken van npm afhankelijkheden",
        "fr": "Démarrer un travailleur UDS pour chaque appareil pour permettre l'écriture de points de données même si aucun calendrier de lecture n'est défini sur cet appareil\nMise à jour des dépendances de npm",
        "it": "Avviare un lavoratore UDS per ogni dispositivo per consentire la scrittura di punti di dati anche quando nessun programma di lettura è definito su questo dispositivo\nAggiornamento delle dipendenze npm",
        "es": "Inicie un trabajador UDS para cada dispositivo para permitir la escritura de puntos de datos incluso cuando no se define ningún horario de lectura en este dispositivo\nActualización de las dependencias npm",
        "pl": "Uruchom pracownika UDS dla każdego urządzenia, aby umożliwić zapisywanie punktów danych, nawet jeśli na tym urządzeniu nie określono harmonogramu odczytu\nAktualizacja zależności npm",
        "uk": "Почати роботу UDS для кожного пристрою, щоб дозволити написання точок даних навіть при відсутності розкладу для читання на цьому пристрої\nОновлення залежності npm",
        "zh-cn": "为每个设备启动一个 UDS 工作程序, 允许写入数据点, 即使没有定义此设备上的读取时间表\nNpm 依赖关系的更新"
      },
      "0.9.3": {
        "en": "Bugfix: Updating UDS communication statistics, even in case of persistent timeout events\nDisabled sinon should interface\nFixes based on issues #55,#56\nBugfix: Time delta between schedules of UDS workes was not working properly",
        "de": "Bugfix: Aktualisierung von UDS-Kommunikationsstatistiken, auch bei anhaltenden Timeout-Ereignissen\nsinon should interface deaktiviert\nBugfixes basierend auf Issues #55,#56\nBugfix: Zeit Delta zwischen den UDS-Workern hat nicht korrekt funktioniert",
        "ru": "Bugfix: Обновление коммуникационной статистики СОД, даже в случае непрерывных событий\nОтключенный Синон должен\n#55,#56\nBugfix: дельта времени между графиками работы СОД не работала должным образом",
        "pt": "Bugfix: Atualizando estatísticas de comunicação UDS, mesmo em caso de eventos de timeout persistentes\nSinon desabilitado deve interface\nCorreções baseadas em questões #55, #56\nBugfix: O tempo delta entre horários de trabalho UDS não estava funcionando corretamente",
        "nl": "Bugfix: UDS-communicatiestatistieken bijwerken, zelfs in geval van aanhoudende timeout\nUitgeschakelde sinon moet interface\nFixes gebaseerd op problemen #55,#56\nBugfix: Tijd delta tussen de schema's van UDS werken werkte niet goed",
        "fr": "Correction : Mise à jour des statistiques de communication UDS, même en cas d'événements persistants de temps mort\nSinon désactivé devrait interfacer\nCorrections basées sur les numéros 55, 56\nCorrection : Temps delta entre les horaires des travaux UDS ne fonctionnait pas correctement",
        "it": "Bugfix: Aggiornamento delle statistiche di comunicazione UDS, anche in caso di eventi di timeout persistenti\nDisabili sinon dovrebbe interfacciarsi\nFissi basati su numeri #55,#56\nBugfix: Il tempo delta tra gli orari dei lavori UDS non funzionava correttamente",
        "es": "Bugfix: Actualización de las estadísticas de comunicación de los UDS, incluso en caso de eventos de timeout persistentes\nImpedido sinon debe interfaz\nArreglos basados en temas #55,#56\nBugfix: El tiempo entre los horarios de los trabajos UDS no funcionaba correctamente",
        "pl": "Bugfix: Aktualizacja statystyk komunikacyjnych UDS, nawet w przypadku trwałych zdarzeń timeout\nWyłączony sinon powinien mieć interfejs\nFixes based on issues # 55, # 56\nBugfix: Czas delta między harmonogramami worków UDS nie działał prawidłowo",
        "uk": "Помилки: Оновлення статистики зв'язку UDS, навіть у випадку наполегливих подій\nВимкнений синон повинен інтерфейс\nВиправлення на основі питань #55,#56\nПомилки: Час дельта між графіками роботи УДС не працює належним чином",
        "zh-cn": "错误修正 : 更新UDS通信统计数据,即使在持续超时的情况下也是如此\n已禁用的西农应接口\n根据问题55、56\n错误修正 : UDS工作时间表之间的时间三角洲工作不当"
      },
      "0.9.2": {
        "en": "Update of dependencies, fixes based on issue #53\nUpdate of list of data points for E3 devices to version 20240808",
        "de": "Aktualisierung von Abhängigkeiten, Korrekturen basierend auf Issue #53\nAktualisierung der Liste der Datenpunkte für E3 Geräte auf Version 20240808",
        "ru": "Обновление зависимостей, исправлений на основе вопроса #53\nОбновление списка точек данных для устройств E3 к версии 20240808",
        "pt": "Atualização de dependências, correções com base no problema #53\nAtualização da lista de pontos de dados para dispositivos E3 para a versão 20240808",
        "nl": "Update van afhankelijkheden, fixes op basis van probleem #53\nUpdate van de lijst van gegevenspunten voor E3-apparaten naar versie 20240808",
        "fr": "Mise à jour des dépendances, corrections basées sur le numéro 53\nMise à jour de la liste des points de données pour les appareils E3 vers la version 20240808",
        "it": "Aggiornamento delle dipendenze, correzioni in base al numero #53\nAggiornamento dell'elenco dei punti dati per i dispositivi E3 alla versione 20240808",
        "es": "Actualización de dependencias, correcciones basadas en el número #53\nActualización de la lista de puntos de datos para dispositivos E3 a la versión 202408",
        "pl": "Aktualizacja zależności, poprawki oparte na numerze # 53\nAktualizacja wykazu punktów danych dla urządzeń E3 do wersji 20240808",
        "uk": "Оновлення залежностей, виправлень на основі випуску #53\nОновлення списку точок даних для пристроїв E3 до версії 202408",
        "zh-cn": "更新依附关系,根据问题53进行修正\nE3设备数据点列表更新至20240808版本"
      },
      "0.9.1": {
        "en": "Updated README, added links for description of device topology and to uses cases\nAdded info for data points 2404_BivalenceControlMode and 2831_BivalenceControlAlternativeTemperature\nUpdate of list of data points for E3 devices to version 20240505",
        "de": "README aktualisiert, Links zur Beschreibung der Gerätetopologie und zu Anwendungsbeispielen ergänzt\nStruktur zu den Datenpunkten 2404_BivalenceControlMode und 2831_BivalenceControlAlternativeTemperature ergänzt\nAktualisierung der Liste der Datenpunkte für E3 Geräte auf Version 20240505",
        "ru": "Обновленный README, добавленные ссылки для описания топологии устройств и для использования случаев\nДобавлена информация для точек данных 2404_BivalenceControlMode и 2831_BivalenceControlAlternativeTemperature\nОбновление списка точек данных для устройств E3 к версии 20240505",
        "pt": "README atualizado, links adicionados para descrição da topologia do dispositivo e para usar casos\nAdicionado info para pontos de dados 2404_BivalenceControlMode e 2831_BivalenceControlAlternativeTemperature\nAtualização da lista de pontos de dados para dispositivos E3 para a versão 20240505",
        "nl": "Bijgewerkt README, toegevoegde links voor de beschrijving van apparaat topologie en te gebruiken gevallen\nToegevoegde info voor datapunten 2404_BivalenceControlMode en 2831_BivalenceControlAlternativeTemperature\nUpdate van de lijst van gegevenspunten voor E3-apparaten naar versie 20240505",
        "fr": "Mise à jour du README, ajout de liens pour la description de la topologie des appareils et pour les cas d'utilisation\nAjouté info pour les points de données 2404_BivalenceControlMode et 2831_BivalenceControlAlternativeTemperature\nMise à jour de la liste des points de données pour les appareils E3 vers la version 20240505",
        "it": "README aggiornato, link aggiunti per la descrizione della topologia del dispositivo e per usi casi\nInformazioni aggiuntive per i punti dati 2404_BivalenceControlMode e 2831_BivalenceControlAlternativeTemperature\nAggiornamento dell'elenco dei punti di dati per i dispositivi E3 alla versione 202405",
        "es": "Actualizado README, añadido enlaces para descripción de la topología del dispositivo y para uso de casos\nInformación adicional para los puntos de datos 2404_BivalenceControlMode y 2831_BivalenceControlAlternativeTemperature\nActualización de la lista de puntos de datos para dispositivos E3 a la versión 20240505",
        "pl": "Aktualizacja README, dodane linki do opisu topologii urządzenia i do zastosowań przypadków\nDodano informacje dla punktów danych 2404 _ BivaleceControlMode i 2831 _ BivaleceControlAltertiveTemperatura\nAktualizacja listy punktów danych dla urządzeń E3 do wersji 20240505",
        "uk": "Оновлено README, додані посилання для опису топології пристрою і для використання випадків\nДодано інформацію для точок даних 2404_BivalenceControlMode та 2831_BivalenceControlAlternativeTemperature\nОновлення списку точок даних для пристроїв E3 до версії 20240505",
        "zh-cn": "更新了 README, 添加了描述设备地形的链接并使用了大小写\n数据点2404_Bivalence Control Mode 和 2831_Bivalence Control AlternativeTemperature 添加信息\nE3设备数据点列表更新至20240505版本"
      },
      "0.9.0": {
        "en": "Structure of data point 1690 (ElectricalEnergySystemPhotovoltaicStatus) changed based on issue https://github.com/MyHomeMyData/E3onCAN/issues/6. Manual adaptations may be needed, please check!\nUpdate of list of data points for E3 devices to version 20240420\nAdded support for energy meter E3100CB\nUpdate of list of data points for E380 to version 20240418\nMain change for E380 id 600/601 (GridEnergy): Now using correct data format. Many thanks to @M4n197 for unveiling the right data format. Manual adaptations may be needed, please check!",
        "de": "Struktur des Datenpunktes 1690 (ElectricalEnergySystemPhotovoltaicStatus) geändert auf der Grundlage des issues https://github.com/MyHomeMyData/E3onCAN/issues/6. Manuelle Anpassungen können erforderlich sein, bitte prüfen!\nAktualisierung der Liste der Datenpunkte für E3 Geräte auf Version 20240420\nUnterstützung für Energiezähler E3100CB\nAktualisierung der Liste der Datenpunkte für E380 auf Version 20240418\nWichtige Änderung für E380 id 600/601 (GridEnergy): Jetzt mit korrektem Datenformat. Vielen Dank an @M4n197 für das Aufdecken des richtigen Datenformats. Manuelle Anpassungen können erforderlich sein, bitte prüfen!",
        "ru": "Структура точки данных 1690 (ElectricalEnergySystemPhotovoltaicStatus) изменилась на основе вопроса https://github.com/MyHomeMyData/E3onCAN/issues/6. Может потребоваться ручная адаптация, пожалуйста, проверьте!\nОбновление списка точек данных для устройств E3 к версии 20240420\nДобавлена поддержка энергометра E3100CB\nОбновление списка точек данных для E380 до версии 20240418\nОсновные изменения для E380 id 600/601 (GridEnergy): Теперь используйте правильный формат данных. Большое спасибо @M4n197 за открытие правильного формата данных. Может потребоваться ручная адаптация, пожалуйста, проверьте!",
        "pt": "Estrutura do ponto de dados 1690 (ElectricalEnergySystemPhotovoltaicStatus) mudou com base na edição https://github.com/MyHomeMyData/E3onCAN/issues/6. Adaptações manuais podem ser necessárias, por favor verifique!\nAtualização da lista de pontos de dados para dispositivos E3 para a versão 20240420\nAdicionado suporte para o medidor de energia E3100CB\nAtualização da lista de pontos de dados para E380 para a versão 20240418\nMudança principal para E380 id 600/601 (GridEnergy): Agora usando o formato de dados correto. Muito obrigado a @M4n197 por revelar o formato de dados correto. Adaptações manuais podem ser necessárias, por favor verifique!",
        "nl": "Zoals vermeld in overweging 17 van de richtsnoeren luchtvaartsteun van 2014. Handmatige aanpassingen kunnen nodig zijn, controleer!\nUpdate van de lijst van gegevenspunten voor E3-apparaten naar versie 20240420\nExtra ondersteuning voor energiemeter E3100CB\nBijwerken van de lijst van gegevenspunten voor E380 naar versie 20240418\nVoornaamste wijziging voor E380 id 600/601 (GridEnergy): Nu met behulp van de juiste gegevensformaat. Hartelijk dank aan @M4n197 voor het onthullen van de juiste data formaat. Handmatige aanpassingen kunnen nodig zijn, controleer!",
        "fr": "La structure des données n° 1690 (ÉlectricalEnergySystemPhotovoltaicStatus) a été modifiée en fonction du numéro https://github.com/MyHomeMyData/E3onCAN/issues/6. Des adaptations manuelles peuvent être nécessaires, veuillez vérifier!\nMise à jour de la liste des points de données pour les appareils E3 vers la version 20240420\nAjout du support pour le compteur d'énergie E3100CB\nMise à jour de la liste des points de données pour E380 à la version 20240418\nChangement principal pour E380 id 600/601 (GridEnergy): Maintenant en utilisant le format de données correct. Merci à @M4n197 pour avoir dévoilé le bon format de données. Des adaptations manuelles peuvent être nécessaires, veuillez vérifier!",
        "it": "Struttura del data point 1690 (ElectricalEnergySystemPhotovoltaicStatus) modificata in base al numero https://github.com/MyHomeMyData/E3onCAN/issues/6. Gli adattamenti manuali possono essere necessari, si prega di controllare!\nAggiornamento dell'elenco dei punti di dati per i dispositivi E3 alla versione 20240420\nAggiunto il supporto per il contatore di energia E3100CB\nAggiornamento dell'elenco dei punti di dati per E380 alla versione 20240418\nCambio principale per E380 id 600/601 (GridEnergy): Ora utilizzando il formato di dati corretto. Molte grazie a @M4n197 per aver svelato il giusto formato di dati. Gli adattamenti manuali possono essere necessari, si prega di controllare!",
        "es": "Estructura del punto de datos 1690 (ElectricalEnergySystemPhotovoltaicStatus) cambió según el número https://github.com/MyHomeMyData/E3onCAN/issues/6. Las adaptaciones manuales pueden ser necesarias, por favor compruebe!\nActualización de la lista de puntos de datos para dispositivos E3 a la versión 20240420\nApoyo añadido al medidor de energía E3100CB\nActualización de los puntos de datos para E380 a la versión 20240418\nCambio principal para E380 id 600/601 (Energía árida): Ahora usando el formato de datos correcto. Muchas gracias a @M4n197 por revelar el formato de datos correcto. Las adaptaciones manuales pueden ser necesarias, por favor compruebe!",
        "pl": "Struktura punktu danych 1690 (ElectricalEnergySystemPhotovoltaicStatus) zmieniła się w oparciu o wydanie https: / / github.com / MyHomeMyData / E3onCAN / issues / 6. Ręczne dostosowania mogą być potrzebne, proszę sprawdzić!\nAktualizacja listy punktów danych dla urządzeń E3 do wersji 20240420\nDodano wsparcie dla licznika energii E3100CB\nAktualizacja wykazu punktów danych dla E380 do wersji 20240418\nGłówna zmiana dla E380 id 600 / 601 (GridEnergy): Teraz używam poprawnego formatu danych. Wielkie podziękowania dla @ M4n197 za odsłonięcie odpowiedniego formatu danych. Ręczne dostosowania mogą być potrzebne, proszę sprawdzić!",
        "uk": "Структура точки даних 1690 (ElectricalEnergySystemPhotovoltaicStatus) змінено на основі випуску https://github.com/MyHomeMyData/E3onCAN/products/6. Пристосування може знадобитися, будь ласка, перевірте!\nОновлення списку точок даних для пристроїв E3 до версії 20240420\nДодано підтримку енергоблоку E3100CB\nОновлення списку точок даних для E380 до версії 20240418\nОсновні зміни для E380 id 600/601 (GridEnergy): Тепер, використовуючи правильний формат даних. Багато завдяки @M4n197 для розміщення формату правих даних. Пристосування може знадобитися, будь ласка, перевірте!",
        "zh-cn": "根据https://github.com/MyHomeMyData/E3onCAN/issues/6. 数据点1690的结构(电能系统系统)发生了变化。 可能需要手工改造,请检查!\nE3设备数据点列表更新至20240420版本\n添加对 E3100CB 能量表的支持\nE380至20240418版本数据点列表更新\nE380 id 600/601(Grid Energy)的主要变化: 现在使用正确的数据格式。 多亏了@M4n197 揭开正确的数据格式. 可能需要手工改造,请检查!"
      },
      "0.8.0": {
        "en": "Added support for energy meter E380 with CAN-address=98\nUpdate of list of data points for E380 to version 20240320",
        "de": "Unterstützung für Energiezähler E380 mit CAN-Adresse=98 ergänzt\nAktualisierung der Liste der Datenpunkte für E380 auf Version 20240320",
        "ru": "Добавлена поддержка энергометра Е380 с CAN-адресом=98\nОбновление списка точек данных для E380 до версии 20240320",
        "pt": "Adicionado suporte para medidor de energia E380 com CAN-endereço=98\nAtualização da lista de pontos de dados para E380 para a versão 20240320",
        "nl": "Toegevoegde ondersteuning voor energiemeter E380 met CAN-adres=98\nBijwerken van de lijst van datapunten voor E380 naar versie 20240320",
        "fr": "Ajout du support pour le compteur d'énergie E380 avec adresse CAN=98\nMise à jour de la liste des points de données pour E380 à la version 20240320",
        "it": "Aggiunto il supporto per il contatore di energia E380 con CAN-address=98\nAggiornamento dell'elenco dei punti di dati per E380 alla versione 20240320",
        "es": "Soporte añadido para medidor de energía E380 con dirección CAN=98\nActualización de la lista de puntos de datos para E380 a la versión 20240320",
        "pl": "Dodano wsparcie dla licznika energii E380 z adresem CAN = 98\nAktualizacja wykazu punktów danych dla E380 do wersji 20240320",
        "uk": "Додано підтримку лічильника енергії E380 з CAN-address=98\nОновлення списку точок даних для E380 до версії 20240320",
        "zh-cn": "对能量计 E380 加上 CAN-address=98 的支持\nE380至20240320版本数据点列表更新"
      }
    },
    "titleLang": {
      "en": "Viessmann E3 CAN do",
      "de": "Viessmann E3 CAN do",
      "ru": "CAN-прослушиватель серии Viessmann E3",
      "pt": "Ouvinte CAN da série Viessmann E3",
      "nl": "Viessmann E3-serie CAN-luisteraar",
      "fr": "Écouteur CAN Viessmann série E3",
      "it": "Ascoltatore CAN Viessmann serie E3",
      "es": "Oyente CAN serie Viessmann E3",
      "pl": "Odbiornik CAN firmy Viessmann serii E3",
      "uk": "CAN-слухач серії Viessmann E3",
      "zh-cn": "菲斯曼E3系列CAN监听器"
    },
    "desc": {
      "en": "Collect data on CAN bus for Viessmann E3 devices, e.g. Vitocal, Vitocharge, Energy Meters E380CA and E3100CB",
      "de": "Greifen Sie auf Daten per CAN-Bus zu, für Viessmann E3-Geräte, z.B. Vitocal, Vitocharge, Energiezähler E380CA und E3100CB",
      "ru": "Сбор данных по шине CAN для устройств Viessmann E3, например. Vitocal, Vitocharge, Счетчик энергии E380CA, E3100CB",
      "pt": "Colete dados no barramento CAN para dispositivos Viessmann E3, por ex. Vitocal, Vitocharge, medidor de energia E380CA, E3100CB",
      "nl": "Verzamel gegevens op de CAN-bus voor Viessmann E3-apparaten, b.v. Vitocal, Vitocharge, Energiemeter E380CA, E3100CB",
      "fr": "Collectez des données sur le bus CAN pour les appareils Viessmann E3, par ex. Vitocal, Vitocharge, Compteur d'énergie E380CA, E3100CB",
      "it": "Raccogliere dati sul bus CAN per dispositivi Viessmann E3, ad es. Vitocal, Vitocharge, Contatore di energia E380CA, E3100CB",
      "es": "Recopilar datos en el bus CAN para dispositivos Viessmann E3, p. Vitocal, Vitocharge, Contador de energía E380CA, E3100CB",
      "pl": "Zbieraj dane na magistrali CAN dla urządzeń Viessmann E3, np.: Vitocal, Vitocharge, licznik energii E380CA, E3100CB",
      "uk": "Збір даних на шині CAN для пристроїв Viessmann E3, напр. Vitocal, Vitocharge, Енерголічильник E380CA, E3100CB",
      "zh-cn": "收集 Viessmann E3 设备 CAN 总线上的数据，例如Vitocal、Vitocharge、能量计 E380CA, E3100CB"
    },
    "authors": [
      "MyHomeMyData <juergen.bonfert@gmail.com>"
    ],
    "keywords": [
      "Viessmann",
      "E3",
      "CAN",
      "Heating",
      "PV",
      "Energy Meter"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "e3oncan.png",
    "enabled": true,
    "messagebox": true,
    "extIcon": "https://raw.githubusercontent.com/MyHomeMyData/ioBroker.e3oncan/main/admin/e3oncan.png",
    "readme": "https://github.com/MyHomeMyData/ioBroker.e3oncan/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "iot-systems",
    "tier": 3,
    "compact": true,
    "connectionType": "local",
    "dataSource": "push",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.13"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<0.7.0",
            "newVersion>=0.7.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "The data type of the numeric values for states in the channel 'tree' has been changed for version 0.7.0 (and later). Numeric values are now stored with the Number data type instead of String. This makes these values easier to use, but may require manual adjustments, such as in existing scripts, history, and vis.",
          "de": "Der Datentyp der Zahlenwerte für States im Kanal 'tree' wurde für Version 0.7.0 (und neuer) geändert. Zahlenwerte werden nun mit dem Datentyp 'Zahl' anstelle von 'Zeichenkette' gespeichert. Dies erleichtert die Verwendung dieser Werte, kann aber manuelle Anpassungen erfordern, wie z.B. in vorhandenen Skripten, History-Daten und Vis.",
          "ru": "Тип данных числовых значений для состояний в канале «дерево» был изменен для версии 0.7.0 (и позже). Численные значения теперь хранятся с типом данных Number вместо String. Это облегчает использование этих значений, но может потребовать корректировки вручную, например, в существующих сценариях, истории и vis.",
          "pt": "O tipo de dados dos valores numéricos para estados no canal 'árvore' foi alterado para a versão 0.7.0 (e mais tarde). Os valores numéricos agora são armazenados com o tipo de dados de Número em vez de String. Isso torna esses valores mais fáceis de usar, mas pode exigir ajustes manuais, como em scripts existentes, história e vis.",
          "nl": "Het gegevenstype van de numerieke waarden voor toestanden in het kanaal 'boom' is gewijzigd voor versie 0.7.0 (en later). Numerieke waarden worden nu opgeslagen met het gegevenstype Nummer in plaats van String. Dit maakt deze waarden gemakkelijker te gebruiken, maar kan handmatige aanpassingen vereisen, zoals in bestaande scripts, geschiedenis en vis.",
          "fr": "Le type de données des valeurs numériques pour les états du canal 'tree' a été modifié pour la version 0.7.0 (et plus tard). Les valeurs numériques sont maintenant stockées avec le type de données Numéro au lieu de String. Cela rend ces valeurs plus faciles à utiliser, mais peut nécessiter des ajustements manuels, comme dans les scripts existants, l'historique et vis.",
          "it": "Il tipo di dati dei valori numerici per gli stati nel canale 'tree' è stato modificato per la versione 0.7.0 (e successivamente). I valori numerici sono ora memorizzati con il tipo di dati Numero invece di String. Questo rende questi valori più facili da usare, ma può richiedere modifiche manuali, come in script esistenti, storia e vis.",
          "es": "El tipo de datos de los valores numéricos para los estados en el canal 'tree' ha sido cambiado para la versión 0.7.0 (y más tarde). Los valores numéricos se almacenan ahora con el tipo de datos Número en lugar de String. Esto facilita el uso de estos valores, pero puede requerir ajustes manuales, como en scripts existentes, historia y vis.",
          "pl": "Typ danych wartości liczbowych dla stanów w kanale 'tree' został zmieniony dla wersji 0.7.0 (i później). Wartości numeryczne są teraz zapisywane z typem danych liczbowych zamiast String. Ułatwia to korzystanie z tych wartości, ale może wymagać ręcznych regulacji, takich jak w istniejących skryptach, historii i vis.",
          "uk": "Тип даних нумеричних значень для станів в каналі 'Жіноча' було змінено для версії 0.7.0 (і пізніше). Чисельні значення тепер зберігаються з типом даних Кількість замість String. Це робить ці значення простіше використовувати, але може знадобитися ручні налаштування, такі як існуючі сценарії, історія і в'язкість.",
          "zh-cn": "频道\"tree\"中状态数字值的数据类型已更改为0.7.0版本(以及后来的版本). 现在用数字数据类型而不是字符串存储数字值。 这使得这些值更容易使用,但可能需要手工调整,如在现有脚本,历史和相对上."
        },
        "link": "https://github.com/MyHomeMyData/ioBroker.e3oncan#changelog",
        "level": "warn",
        "linkText": {
          "en": "Changelog",
          "de": "Änderungsprotokoll",
          "ru": "Список изменений",
          "pt": "Registro de alterações",
          "nl": "Wijzigingslog",
          "fr": "Journal des modifications",
          "it": "Registro delle modifiche",
          "es": "registro de cambios",
          "pl": "Dziennik zmian",
          "zh-cn": "变更日志",
          "uk": "Журнал змін"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "tableUdsDevices": [],
    "tableUdsDids": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": {
          "en": "Information",
          "de": "Informationen",
          "ru": "Информация",
          "pt": "Informação",
          "nl": "Informatie",
          "fr": "Informations",
          "it": "Informazioni",
          "es": "Información",
          "pl": "Informacje",
          "uk": "Інформація",
          "zh-cn": "资料"
        }
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": {
          "en": "Device or service connected",
          "de": "Geräte oder Service vrbunden",
          "ru": "Устройство или служба подключены",
          "pt": "Dispositivo ou serviço conectado",
          "nl": "Apparaat of dienst verbonden",
          "fr": "Appareil ou service connecté",
          "it": "Dispositivo o servizio collegato",
          "es": "Dispositivo o servicio conectado",
          "pl": "Przyłączone urządzenie lub usługa",
          "uk": "Пристрої або послуги підключені",
          "zh-cn": "设备或服务已连接"
        },
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
