{
    "CAN Adapter": "CAN-adapter",
    "Please start this adapter instance to enable further configuration options.": "Start deze adapterinstantie om verdere configuratieopties in te schakelen.",
    "Please press button 'Save', when you're done on this tab.": "Als u klaar bent op dit tabblad, drukt u op de knop 'Opslaan'.",
    "External CAN Adapter": "Externe CAN-adapter",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Apparaatdeel van CAN-adapter aangesloten op externe bus, b.v. kan0",
    "Connect to Adapter": "Sluit aan op adapter",
    "Internal CAN Adapter": "Interne CAN-adapter",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Apparaatdeel van CAN-adapter aangesloten op interne bus, b.v. kan1",
    "List of UDS devices": "Lijst met UDS-apparaten",
    "List of available devices": "Lijst met beschikbare apparaten",
    "Configuration requires a running adapter instance!": "Voor configuratie is een actieve adapterinstantie vereist!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "U kunt de tweede kolom bewerken om de statusnaam voor het apparaat in te stellen (zichtbaar in de objectboom).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "De UDS-apparaatscan is bezig. Dit kan maximaal 20 seconden duren.",
    "'Device state name' must not be blank!": "'Apparaatstatusnaam' mag niet leeg zijn!",
    "Symbol '.' not allowed in 'Device state name'": "Symbool '.' niet toegestaan ​​in 'Apparaatstatusnaam'",
    "Device name (Viessmann)": "Apparaatnaam (Viessmann)",
    "Device state name": "Naam van apparaatstatus",
    "Device ECU name (fixed)": "Apparaat-ECU-naam (vast)",
    "Device Address": "Apparaatadres",
    "Device ECU address (fixed)": "Apparaat-ECU-adres (vast)",
    "CAN id for collecting data": "CAN-id voor het verzamelen van gegevens",
    "CAN id - still experimental. Leave blank for deactivation.": "CAN-id - nog steeds experimenteel. Laat leeg voor deactivering.",
    "List of datapoints": "Lijst met datapunten",
    "Start scan for datapoints of all devices": "Start de scan naar datapunten van alle apparaten",
    "Confirm scan for datapoints": "Bevestig de scan voor datapunten",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "Het scannen duurt maximaal 5 minuten. Zorg ervoor dat er geen andere UDSonCAN-client (bijvoorbeeld Open3Eclient.py) actief is. Sluit het tabblad niet tijdens het scannen. U kunt de voortgang volgen door het logboek op een extra tabblad te bekijken.",
    "OK": "OK",
    "Cancel": "Annuleren",
    "Select device": "Selecteer apparaat",
    "List of device specific datapoints": "Lijst met apparaatspecifieke datapunten",
    "ID": "ID kaart",
    "Id of datapoint": "Id van datapunt",
    "Length": "Lengte",
    "Length of datapoint": "Lengte van datapunt",
    "Name": "Naam",
    "Name of datapoint": "Naam van datapunt",
    "Codec": "Codec",
    "Codec used for datapoint": "Codec gebruikt voor datapunt",
    "Assignments to External CAN Adapter": "Toewijzingen aan externe CAN-adapter",
    "Energy Meter E380": "Energiemeter E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "WAARSCHUWING: Waarden onder de 2 seconden kunnen een zware systeembelasting veroorzaken!",
    "Activate communication": "Activeer communicatie",
    "This text will be used as base for object tree": "Deze tekst zal worden gebruikt als basis voor de objectboom",
    "Min. update time (s)": "Min. update tijd(en)",
    "Minumum update time for states. 0 for immediate update.": "Minimale updatetijd voor staten. 0 voor onmiddellijke update.",
    "Collecting Data on External CAN Adapter": "Gegevens verzamelen op externe CAN-adapter",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Luister naar gegevens over adressen in deze tabel. Geen schrijven naar CAN-bus. Druk op '+' om te beginnen.",
    "No device for collecting available (missing CAN ID).": "Geen apparaat voor verzamelen beschikbaar (ontbrekende CAN ID).",
    "ERROR: column 'Device state name' must contain unique text.": "FOUT: kolom 'Apparaatstatusnaam' moet unieke tekst bevatten.",
    "active": "actief",
    "Requesting data on external CAN Adapter via UDSonCAN": "Gegevens opvragen op externe CAN-adapter via UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Geef schema's voor apparaten op, druk op '+' om te beginnen.",
    "Schedule (s)": "Schema('s)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Schema voor het aanvragen van bepaalde datapunten. 0 voor een eenmalig verzoek bij het starten van de adapterinstantie.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Gescheiden door komma! Alle gegeven datapunten worden opgevraagd met een gespecificeerd schema en ECU-adres.",
    "Assignments to Internal CAN Adapter": "Toewijzingen aan interne CAN-adapter",
    "Collecting Data on Internal CAN Adapter": "Gegevens verzamelen over de interne CAN-adapter",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Luister naar gegevens over adressen in deze tabel. Geen schrijven naar CAN-bus.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Apparaten voor het verzamelen van gegevens. Geen schrijven naar CAN-bus. Druk op '+' om apparaat toe te voegen.",
    "Update list of datapoints": "Lijst met datapunten bijwerken",
    "Start scan to update list of devices": "Start de scan om de lijst met apparaten bij te werken",
    "Description": "Beschrijving",
    "Optional description of this schedule.": "Optionele beschrijving van dit schema.",
    "Energy Meters": "Energiemeters",
    "UDS CAN Adapter": "UDS CAN-adapter",
    "Device mame of CAN adapter connected to UDS-capable bus, e.g. can0": "Apparaatdeel van CAN-adapter aangesloten op UDS-compatibele bus, b.v. kan0",
    "Assignments to UDS CAN Adapter": "Toewijzingen aan UDS CAN-adapter",
    "Collecting Data on UDS CAN Adapter": "Gegevens verzamelen op de UDS CAN-adapter",
    "Requesting data on UDS CAN Adapter via UDSonCAN": "Gegevens opvragen over de UDS CAN Adapter via UDSonCAN",
    "Second CAN Adapter": "Tweede CAN-adapter",
    "Device mame of CAN adapter connected to second bus, e.g. can1": "Apparaatdeel van CAN-adapter aangesloten op tweede bus, b.v. kan1",
    "Assignments to second CAN Adapter": "Toewijzingen aan tweede CAN-adapter",
    "Collecting Data on second CAN Adapter": "Gegevens verzamelen op de tweede CAN-adapter"
}
