{
    "CAN Adapter": "CAN-Adapter",
    "Please start this adapter instance to enable further configuration options.": "Bitte starten Sie diese Adapterinstanz, um weitere Konfigurationsoptionen zu aktivieren.",
    "Please press button 'Save', when you're done on this tab.": "Bitte klicken Sie auf die Schaltfläche „Speichern“, wenn Sie auf dieser Registerkarte fertig sind.",
    "External CAN Adapter": "Externer CAN-Adapter",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Gerätename des CAN-Adapters, der an den externen Bus angeschlossen ist, z.B. can0",
    "Connect to Adapter": "Mit Adapter verbinden",
    "Internal CAN Adapter": "Interner CAN-Adapter",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Gerätename des CAN-Adapters, der an den internen Bus angeschlossen ist, z. B. can1",
    "List of UDS devices": "Liste der UDS-Geräte",
    "List of available devices": "Liste der verfügbaren Geräte",
    "Configuration requires a running adapter instance!": "Für die Konfiguration ist eine laufende Adapterinstanz erforderlich!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Sie können die zweite Spalte bearbeiten, um den State-Namen für das Gerät festzulegen (sichtbar im Objektbaum).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "Der UDS-Gerätescan läuft. Dies kann bis zu 20 Sekunden dauern.",
    "'Device state name' must not be blank!": "„Geräte State-Name“ darf nicht leer sein!",
    "Symbol '.' not allowed in 'Device state name'": "Symbol '.' nicht erlaubt in „Geräte State-Name“",
    "Device name (Viessmann)": "Gerätename (Viessmann)",
    "Device state name": "Geräte State-Name",
    "Device ECU name (fixed)": "Geräte-ECU-Name (nicht änderbar)",
    "Device Address": "Geräteadresse",
    "Device ECU address (fixed)": "Geräte-ECU-Adresse (fesnicht änderbar)",
    "CAN id for collecting data": "CAN-ID zum Sammeln von Daten",
    "CAN id - still experimental. Leave blank for deactivation.": "CAN-ID – noch experimentell. Zur Deaktivierung leer lassen.",
    "List of datapoints": "Liste der Datenpunkte",
    "Start scan for datapoints of all devices": "Suche nach Datenpunkten aller Geräte starten",
    "Confirm scan for datapoints": "Bestätigen Sie den Start der Suche nach Datenpunkten",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "Der Scanvorgang dauert bis zu 5 Minuten. Bitte stellen Sie sicher, dass kein anderer UDSonCAN-Client (z.B. Open3Eclient.py) läuft. Bitte schließen Sie die Registerkarte während des Scanvorgangs nicht. Sie können den Fortschritt verfolgen, indem Sie sich das Protokoll auf einer zusätzlichen Registerkarte ansehen.",
    "OK": "OK",
    "Cancel": "Abbrechen",
    "Select device": "Gerät auswählen",
    "List of device specific datapoints": "Liste gerätespezifischer Datenpunkte",
    "ID": "ID",
    "Id of datapoint": "ID des Datenpunkts",
    "Length": "Länge",
    "Length of datapoint": "Länge des Datenpunkts",
    "Name": "Name",
    "Name of datapoint": "Name des Datenpunkts",
    "Codec": "Codec",
    "Codec used for datapoint": "Für den Datenpunkt verwendeter Codec",
    "Assignments to External CAN Adapter": "Zuweisungen zum externen CAN-Adapter",
    "Energy Meter E380": "Energiezähler E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "ACHTUNG: Werte unter 2 Sekunden können zu hoher Systemlast führen!",
    "Activate communication": "Kommunikation aktivieren",
    "This text will be used as base for object tree": "Dieser Text wird als Basis für den Objektbaum verwendet",
    "Min. update time (s)": "Min. Aktualisierungszeit (s)",
    "Minumum update time for states. 0 for immediate update.": "Minimale Aktualisierungszeit für States. 0 für sofortige Aktualisierung.",
    "Collecting Data on External CAN Adapter": "Sammeln von Daten auf dem externen CAN-Adapter",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Liste der Geräten für das passive Sammeln von Daten. Kein Schreiben auf den CAN-Bus. Drücken Sie „+“, um ein Gerät hinzuzufügen.",
    "No device for collecting available (missing CAN ID).": "Kein Gerät zum Sammeln verfügbar (fehlende CAN-ID).",
    "ERROR: column 'Device state name' must contain unique text.": "FEHLER: Spalte „Geräte State-Name“ muss eindeutig sein.",
    "active": "aktiv",
    "Requesting data on external CAN Adapter via UDSonCAN": "Anfordern von Daten auf einem externen CAN-Adapter über UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Geben Sie Zeitpläne für Geräte an und drücken Sie zum Hinzufügen „+“.",
    "Schedule (s)": "Wiederholungszeit (s)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Zeitlicher Abstand für die Anforderung der Datenpunkte. 0 für eine einmalige Abfrage beim Start der Adapterinstanz.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Durch Komma trennen! Alle angegebenen Datenpunkte werden mit der angegebenen Wiederholungszeit von der ECU-Adresse angefordert.",
    "Assignments to Internal CAN Adapter": "Zuordnungen zum internen CAN-Adapter",
    "Collecting Data on Internal CAN Adapter": "Sammeln von Daten auf dem internen CAN-Adapter",
    "Update list of datapoints": "Liste der Datenpunkte aktualisieren"
}
