{
    "CAN Adapter": "Адаптер CAN",
    "Please start this adapter instance to enable further configuration options.": "Будь ласка, запустіть цей екземпляр адаптера, щоб увімкнути додаткові параметри конфігурації.",
    "Please press button 'Save', when you're done on this tab.": "Будь ласка, натисніть кнопку «Зберегти», коли закінчите на цій вкладці.",
    "External CAN Adapter": "Зовнішній адаптер CAN",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Пристрій адаптера CAN, підключеного до зовнішньої шини, напр. can0",
    "Connect to Adapter": "Підключити до адаптера",
    "Internal CAN Adapter": "Внутрішній адаптер CAN",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Пристрій адаптера CAN, підключеного до внутрішньої шини, напр. can1",
    "List of UDS devices": "Список пристроїв UDS",
    "List of available devices": "Список доступних пристроїв",
    "Configuration requires a running adapter instance!": "Для конфігурації потрібен запущений екземпляр адаптера!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Ви можете відредагувати 2-й стовпець, щоб встановити назву стану для пристрою (видно в дереві об’єктів).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "Сканування пристрою UDS триває. Це може зайняти до 20 секунд.",
    "'Device state name' must not be blank!": "Поле «Назва стану пристрою» не повинно бути пустим!",
    "Symbol '.' not allowed in 'Device state name'": "Символ «.» заборонено в \"Назві стану пристрою\"",
    "Device name (Viessmann)": "Назва пристрою (Viessmann)",
    "Device state name": "Назва стану пристрою",
    "Device ECU name (fixed)": "Назва ECU пристрою (фіксована)",
    "Device Address": "Адреса пристрою",
    "Device ECU address (fixed)": "Адреса ECU пристрою (фіксована)",
    "CAN id for collecting data": "Ідентифікатор CAN для збору даних",
    "CAN id - still experimental. Leave blank for deactivation.": "Ідентифікатор CAN - все ще експериментальний. Залиште порожнім для деактивації.",
    "List of datapoints": "Список точок даних",
    "Start scan for datapoints of all devices": "Розпочати сканування точок даних усіх пристроїв",
    "Confirm scan for datapoints": "Підтвердьте сканування точок даних",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "Сканування триватиме до 5 хвилин. Будь ласка, переконайтеся, що жоден інший клієнт UDSonCAN (наприклад, Open3Eclient.py) не працює. Не закривайте вкладку під час сканування. Ви можете стежити за прогресом, спостерігаючи за входом на додатковій вкладці.",
    "OK": "в порядку",
    "Cancel": "Скасувати",
    "Select device": "Виберіть пристрій",
    "List of device specific datapoints": "Список конкретних точок даних пристрою",
    "ID": "ID",
    "Id of datapoint": "Ідентифікатор точки даних",
    "Length": "Довжина",
    "Length of datapoint": "Довжина точки даних",
    "Name": "Ім'я",
    "Name of datapoint": "Назва точки даних",
    "Codec": "Кодек",
    "Codec used for datapoint": "Кодек, який використовується для точки даних",
    "Assignments to External CAN Adapter": "Призначення зовнішнього адаптера CAN",
    "Energy Meter E380": "Лічильник електроенергії E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "ПОПЕРЕДЖЕННЯ: Значення нижче 2 секунд можуть спричинити велике навантаження на систему!",
    "Activate communication": "Активізуйте спілкування",
    "This text will be used as base for object tree": "Цей текст буде використано як основу для дерева об’єктів",
    "Min. update time (s)": "Хв. час оновлення (с)",
    "Minumum update time for states. 0 for immediate update.": "Мінімальний час оновлення для станів. 0 для негайного оновлення.",
    "Collecting Data on External CAN Adapter": "Збір даних про зовнішній адаптер CAN",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Прослухайте дані за адресами, наведені в цій таблиці. Немає запису на шину CAN. Натисніть «+», щоб почати.",
    "No device for collecting available (missing CAN ID).": "Немає доступного пристрою для збору (відсутній ідентифікатор CAN).",
    "ERROR: column 'Device state name' must contain unique text.": "ПОМИЛКА: стовпець \"Назва стану пристрою\" повинен містити унікальний текст.",
    "active": "активний",
    "Requesting data on external CAN Adapter via UDSonCAN": "Запит даних на зовнішній адаптер CAN через UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Вкажіть розклади для пристроїв, натисніть «+», щоб почати.",
    "Schedule (s)": "Розклад (и)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Розклад запиту заданих точок даних. 0 для одноразового запиту під час запуску екземпляра адаптера.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Розділіть комами! Усі задані точки даних будуть запитані з указаним розкладом і адресою ECU.",
    "Assignments to Internal CAN Adapter": "Призначення внутрішнього адаптера CAN",
    "Collecting Data on Internal CAN Adapter": "Збір даних про внутрішній адаптер CAN",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Прослухайте дані за адресами, наведені в цій таблиці. Немає запису на шину CAN.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Пристрої для збору даних. Немає запису на шину CAN. Натисніть «+», щоб додати пристрій.",
    "Update list of datapoints": "Оновити список точок даних"
}
