{
    "CAN Adapter": "Adapter CAN",
    "Please start this adapter instance to enable further configuration options.": "Uruchom tę instancję adaptera, aby włączyć dalsze opcje konfiguracji.",
    "Please press button 'Save', when you're done on this tab.": "Po zakończeniu pracy na tej karcie naciśnij przycisk „Zapisz”.",
    "External CAN Adapter": "Zewnętrzny adapter CAN",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Urządzenie mam adaptera CAN podłączonego do magistrali zewnętrznej, np. może0",
    "Connect to Adapter": "Połącz się z adapterem",
    "Internal CAN Adapter": "Wewnętrzny adapter CAN",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Urządzenie mam adaptera CAN podłączonego do magistrali wewnętrznej, np.: może1",
    "List of UDS devices": "Lista urządzeń UDS",
    "List of available devices": "Lista dostępnych urządzeń",
    "Configuration requires a running adapter instance!": "Konfiguracja wymaga działającej instancji adaptera!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Możesz edytować drugą kolumnę, aby ustawić nazwę stanu urządzenia (widoczną w drzewie obiektów).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "Trwa skanowanie urządzenia UDS. Może to potrwać do 20 sekund.",
    "'Device state name' must not be blank!": "Pole „Nazwa stanu urządzenia” nie może być puste!",
    "Symbol '.' not allowed in 'Device state name'": "Symbol „.” niedozwolone w „Nazwie stanu urządzenia”",
    "Device name (Viessmann)": "Nazwa urządzenia (Viessmann)",
    "Device state name": "Nazwa stanu urządzenia",
    "Device ECU name (fixed)": "Nazwa ECU urządzenia (stała)",
    "Device Address": "Adres urządzenia",
    "Device ECU address (fixed)": "Adres ECU urządzenia (stały)",
    "CAN id for collecting data": "Identyfikator CAN do gromadzenia danych",
    "CAN id - still experimental. Leave blank for deactivation.": "Identyfikator CAN - wciąż eksperymentalny. Pozostaw puste w celu dezaktywacji.",
    "List of datapoints": "Lista punktów danych",
    "Start scan for datapoints of all devices": "Rozpocznij skanowanie w poszukiwaniu punktów danych wszystkich urządzeń",
    "Confirm scan for datapoints": "Potwierdź skanowanie w poszukiwaniu punktów danych",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "Skanowanie zajmie do 5 minut. Upewnij się, że nie jest uruchomiony żaden inny klient UDSonCAN (np. Open3Eclient.py). Proszę nie zamykać zakładki podczas skanowania. Postęp możesz śledzić obserwując Logowanie w dodatkowej zakładce.",
    "OK": "OK",
    "Cancel": "Anulować",
    "Select device": "Wybierz urządzenie",
    "List of device specific datapoints": "Lista punktów danych specyficznych dla urządzenia",
    "ID": "ID",
    "Id of datapoint": "Identyfikator punktu danych",
    "Length": "Długość",
    "Length of datapoint": "Długość punktu danych",
    "Name": "Nazwa",
    "Name of datapoint": "Nazwa punktu danych",
    "Codec": "Kodek",
    "Codec used for datapoint": "Kodek używany w punkcie danych",
    "Assignments to External CAN Adapter": "Przypisania do zewnętrznego adaptera CAN",
    "Energy Meter E380": "Licznik energii E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "OSTRZEŻENIE: Wartości poniżej 2 sekund mogą spowodować duże obciążenie systemu!",
    "Activate communication": "Aktywuj komunikację",
    "This text will be used as base for object tree": "Tekst ten posłuży jako baza dla drzewa obiektów",
    "Min. update time (s)": "Min. czas aktualizacji",
    "Minumum update time for states. 0 for immediate update.": "Minimalny czas aktualizacji dla stanów. 0 do natychmiastowej aktualizacji.",
    "Collecting Data on External CAN Adapter": "Zbieranie danych na zewnętrznym adapterze CAN",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Posłuchaj danych o adresach podanych w tej tabeli. Brak zapisu do magistrali CAN. Naciśnij „+”, aby rozpocząć.",
    "No device for collecting available (missing CAN ID).": "Brak dostępnego urządzenia do odbioru (brak identyfikatora CAN).",
    "ERROR: column 'Device state name' must contain unique text.": "BŁĄD: kolumna „Nazwa stanu urządzenia” musi zawierać unikalny tekst.",
    "active": "aktywny",
    "Requesting data on external CAN Adapter via UDSonCAN": "Żądanie danych na zewnętrznym adapterze CAN poprzez UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Określ harmonogramy dla urządzeń, naciśnij „+”, aby rozpocząć.",
    "Schedule (s)": "Harmonogram (y)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Harmonogram żądania danych punktów. 0 dla jednorazowego żądania przy uruchomieniu instancji adaptera.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Oddziel przecinkiem! Wszystkie podane punkty danych zostaną poproszone o podanie określonego harmonogramu i adresu ECU.",
    "Assignments to Internal CAN Adapter": "Przypisania do wewnętrznego adaptera CAN",
    "Collecting Data on Internal CAN Adapter": "Zbieranie danych na wewnętrznym adapterze CAN",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Posłuchaj danych o adresach podanych w tej tabeli. Brak zapisu do magistrali CAN.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Urządzenia do gromadzenia danych. Brak zapisu do magistrali CAN. Naciśnij „+”, aby dodać urządzenie.",
    "Update list of datapoints": "Zaktualizuj listę punktów danych",
    "Start scan to update list of devices": "Rozpocznij skanowanie, aby zaktualizować listę urządzeń",
    "Description": "Opis",
    "Optional description of this schedule.": "Opcjonalny opis tego harmonogramu.",
    "Energy Meters": "Liczniki energii",
    "UDS CAN Adapter": "Adapter UDS CAN",
    "Device mame of CAN adapter connected to UDS-capable bus, e.g. can0": "Urządzenie mam adaptera CAN podłączone do magistrali obsługującej UDS, np. może0",
    "Assignments to UDS CAN Adapter": "Przypisania do adaptera UDS CAN",
    "Collecting Data on UDS CAN Adapter": "Zbieranie danych na adapterze UDS CAN",
    "Requesting data on UDS CAN Adapter via UDSonCAN": "Żądanie danych na adapterze UDS CAN poprzez UDSonCAN",
    "Second CAN Adapter": "Drugi adapter CAN",
    "Device mame of CAN adapter connected to second bus, e.g. can1": "Urządzenie mam adaptera CAN podłączone do drugiej magistrali, np. może1",
    "Assignments to second CAN Adapter": "Przypisania do drugiego adaptera CAN",
    "Collecting Data on second CAN Adapter": "Zbieranie danych na drugim adapterze CAN"
}
