{
    "CAN Adapter": "CAN-адаптер",
    "Please start this adapter instance to enable further configuration options.": "Запустите этот экземпляр адаптера, чтобы включить дополнительные параметры конфигурации.",
    "Please press button 'Save', when you're done on this tab.": "Пожалуйста, нажмите кнопку «Сохранить», когда вы закончите работу на этой вкладке.",
    "External CAN Adapter": "Внешний CAN-адаптер",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Имя устройства адаптера CAN, подключенного к внешней шине, например. может0",
    "Connect to Adapter": "Подключиться к адаптеру",
    "Internal CAN Adapter": "Внутренний CAN-адаптер",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Имя устройства адаптера CAN, подключенного к внутренней шине, например. может1",
    "List of UDS devices": "Список устройств UDS",
    "List of available devices": "Список доступных устройств",
    "Configuration requires a running adapter instance!": "Для конфигурации требуется работающий экземпляр адаптера!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Вы можете отредактировать второй столбец, чтобы установить имя состояния устройства (видно в дереве объектов).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "Сканирование устройства UDS продолжается. Это может занять до 20 секунд.",
    "'Device state name' must not be blank!": "«Имя состояния устройства» не должно быть пустым!",
    "Symbol '.' not allowed in 'Device state name'": "Символ '.' не разрешено в «Имя состояния устройства»",
    "Device name (Viessmann)": "Имя устройства (Viessmann)",
    "Device state name": "Название состояния устройства",
    "Device ECU name (fixed)": "Имя ЭБУ устройства (фиксированное)",
    "Device Address": "Адрес устройства",
    "Device ECU address (fixed)": "Адрес ЭБУ устройства (фиксированный)",
    "CAN id for collecting data": "CAN-идентификатор для сбора данных",
    "CAN id - still experimental. Leave blank for deactivation.": "CAN id - все еще экспериментальный. Оставьте пустым для деактивации.",
    "List of datapoints": "Список точек данных",
    "Start scan for datapoints of all devices": "Запустить сканирование точек данных всех устройств.",
    "Confirm scan for datapoints": "Подтвердить сканирование точек данных",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "Сканирование займет до 5 минут. Убедитесь, что ни один другой клиент UDsonCAN (например, Open3Eclient.py) не запущен. Пожалуйста, не закрывайте вкладку во время сканирования. За ходом работы вы можете следить, просматривая Журнал на дополнительной вкладке.",
    "OK": "ХОРОШО",
    "Cancel": "Отмена",
    "Select device": "Выберите устройство",
    "List of device specific datapoints": "Список точек данных для конкретного устройства",
    "ID": "ИДЕНТИФИКАТОР",
    "Id of datapoint": "Идентификатор точки данных",
    "Length": "Длина",
    "Length of datapoint": "Длина точки данных",
    "Name": "Имя",
    "Name of datapoint": "Имя точки данных",
    "Codec": "Кодек",
    "Codec used for datapoint": "Кодек, используемый для точки данных",
    "Assignments to External CAN Adapter": "Назначение внешнего CAN-адаптера",
    "Energy Meter E380": "Счетчик энергии E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "ВНИМАНИЕ: значения ниже 2 секунд могут привести к большой нагрузке на систему!",
    "Activate communication": "Активировать общение",
    "This text will be used as base for object tree": "Этот текст будет использоваться в качестве основы для дерева объектов.",
    "Min. update time (s)": "Мин. время обновления (сек)",
    "Minumum update time for states. 0 for immediate update.": "Минимальное время обновления состояний. 0 для немедленного обновления.",
    "Collecting Data on External CAN Adapter": "Сбор данных о внешнем CAN-адаптере",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Прослушайте данные по адресам, указанным в этой таблице. Нет записи в CAN-шину. Нажмите «+», чтобы начать.",
    "No device for collecting available (missing CAN ID).": "Устройство для сбора данных отсутствует (отсутствует CAN ID).",
    "ERROR: column 'Device state name' must contain unique text.": "ОШИБКА: столбец «Имя состояния устройства» должен содержать уникальный текст.",
    "active": "активный",
    "Requesting data on external CAN Adapter via UDSonCAN": "Запрос данных о внешнем CAN-адаптере через UDsonCAN",
    "Specify schedules for devices, press '+' to begin.": "Укажите расписания для устройств, нажмите «+», чтобы начать.",
    "Schedule (s)": "Расписание(а)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Расписание запроса заданных точек данных. 0 для однократного запроса при запуске экземпляра адаптера.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Разделяйте запятой! Все заданные точки данных будут запрошены с указанным расписанием и адресом ЭБУ.",
    "Assignments to Internal CAN Adapter": "Назначения внутреннего CAN-адаптера",
    "Collecting Data on Internal CAN Adapter": "Сбор данных о внутреннем CAN-адаптере",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Прослушайте данные по адресам, указанным в этой таблице. Нет записи в CAN-шину.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Устройства для сбора данных. Нет записи в CAN-шину. Нажмите «+», чтобы добавить устройство.",
    "Update list of datapoints": "Обновить список точек данных",
    "Start scan to update list of devices": "Запустите сканирование, чтобы обновить список устройств.",
    "Description": "Описание",
    "Optional description of this schedule.": "Необязательное описание этого расписания."
}
