{
    "CAN Adapter": "Adaptador CAN",
    "Please start this adapter instance to enable further configuration options.": "Inicie esta instância do adaptador para ativar outras opções de configuração.",
    "Please press button 'Save', when you're done on this tab.": "Por favor, pressione o botão 'Salvar' quando terminar nesta guia.",
    "External CAN Adapter": "Adaptador CAN externo",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Dispositivo mame do adaptador CAN conectado ao barramento externo, por ex. can0",
    "Connect to Adapter": "Conecte ao adaptador",
    "Internal CAN Adapter": "Adaptador CAN interno",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Dispositivo mame do adaptador CAN conectado ao barramento interno, por ex. lata1",
    "List of UDS devices": "Lista de dispositivos UDS",
    "List of available devices": "Lista de dispositivos disponíveis",
    "Configuration requires a running adapter instance!": "A configuração requer uma instância do adaptador em execução!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Você pode editar a segunda coluna para definir o nome do estado do dispositivo (visível na árvore de objetos).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "A verificação do dispositivo UDS está em andamento. Isso pode levar até 20 segundos.",
    "'Device state name' must not be blank!": "'Nome do estado do dispositivo' não deve ficar em branco!",
    "Symbol '.' not allowed in 'Device state name'": "Símbolo '.' não permitido em 'Nome do estado do dispositivo'",
    "Device name (Viessmann)": "Nome do dispositivo (Viessmann)",
    "Device state name": "Nome do estado do dispositivo",
    "Device ECU name (fixed)": "Nome da ECU do dispositivo (fixo)",
    "Device Address": "Endereço do dispositivo",
    "Device ECU address (fixed)": "Endereço ECU do dispositivo (fixo)",
    "CAN id for collecting data": "CAN id para coleta de dados",
    "CAN id - still experimental. Leave blank for deactivation.": "CAN id - ainda experimental. Deixe em branco para desativação.",
    "List of datapoints": "Lista de pontos de dados",
    "Start scan for datapoints of all devices": "Comece a procurar pontos de dados de todos os dispositivos",
    "Confirm scan for datapoints": "Confirme a varredura de pontos de dados",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "A verificação levará até 5 minutos. Certifique-se de que nenhum outro cliente UDSoCAN (por exemplo, Open3Eclient.py) esteja em execução. Por favor, não feche a guia durante a verificação. Você pode acompanhar o progresso observando o Log em uma aba adicional.",
    "OK": "OK",
    "Cancel": "Cancelar",
    "Select device": "Selecionar dispositivo",
    "List of device specific datapoints": "Lista de pontos de dados específicos do dispositivo",
    "ID": "EU IA",
    "Id of datapoint": "ID do ponto de dados",
    "Length": "Comprimento",
    "Length of datapoint": "Comprimento do ponto de dados",
    "Name": "Nome",
    "Name of datapoint": "Nome do ponto de dados",
    "Codec": "Codec",
    "Codec used for datapoint": "Codec usado para ponto de dados",
    "Assignments to External CAN Adapter": "Atribuições ao adaptador CAN externo",
    "Energy Meter E380": "Medidor de Energia E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "AVISO: Valores abaixo de 2 segundos podem causar carga pesada no sistema!",
    "Activate communication": "Ativar comunicação",
    "This text will be used as base for object tree": "Este texto será usado como base para a árvore de objetos",
    "Min. update time (s)": "Min. tempo(s) de atualização",
    "Minumum update time for states. 0 for immediate update.": "Tempo mínimo de atualização para estados. 0 para atualização imediata.",
    "Collecting Data on External CAN Adapter": "Coletando dados no adaptador CAN externo",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Ouça os dados sobre os endereços fornecidos nesta tabela. Não há gravação no barramento CAN. Pressione '+' para começar.",
    "No device for collecting available (missing CAN ID).": "Nenhum dispositivo para coleta disponível (Falta CAN ID).",
    "ERROR: column 'Device state name' must contain unique text.": "ERRO: a coluna 'Nome do estado do dispositivo' deve conter texto exclusivo.",
    "active": "ativo",
    "Requesting data on external CAN Adapter via UDSonCAN": "Solicitando dados no adaptador CAN externo via UDSoCAN",
    "Specify schedules for devices, press '+' to begin.": "Especifique programações para dispositivos, pressione '+' para começar.",
    "Schedule (s)": "Cronograma(s)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Agenda para solicitação de determinados pontos de dados. 0 para solicitação única no início da instância do adaptador.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Separe por vírgula! Todos os pontos de dados fornecidos serão solicitados com programação especificada e endereço de ECU.",
    "Assignments to Internal CAN Adapter": "Atribuições ao adaptador CAN interno",
    "Collecting Data on Internal CAN Adapter": "Coletando dados no adaptador CAN interno",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Ouça os dados sobre os endereços fornecidos nesta tabela. Não há gravação no barramento CAN.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Dispositivos para coleta de dados. Não há gravação no barramento CAN. Pressione '+' para adicionar dispositivo.",
    "Update list of datapoints": "Atualizar lista de pontos de dados"
}
