{
    "CAN Adapter": "Adattatore CAN",
    "Please start this adapter instance to enable further configuration options.": "Avvia questa istanza dell'adattatore per abilitare ulteriori opzioni di configurazione.",
    "Please press button 'Save', when you're done on this tab.": "Premi il pulsante \"Salva\" una volta terminato in questa scheda.",
    "External CAN Adapter": "Adattatore CAN esterno",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Nome del dispositivo dell'adattatore CAN collegato al bus esterno, ad es. can0",
    "Connect to Adapter": "Connetti all'adattatore",
    "Internal CAN Adapter": "Adattatore CAN interno",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Nome del dispositivo dell'adattatore CAN collegato al bus interno, ad es. può1",
    "List of UDS devices": "Elenco dei dispositivi UDS",
    "List of available devices": "Elenco dei dispositivi disponibili",
    "Configuration requires a running adapter instance!": "La configurazione richiede un'istanza dell'adattatore in esecuzione!",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "È possibile modificare la seconda colonna per impostare il nome dello stato per il dispositivo (visibile nell'albero degli oggetti).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "La scansione del dispositivo UDS è in corso. L'operazione potrebbe richiedere fino a 20 secondi.",
    "'Device state name' must not be blank!": "Il \"Nome stato del dispositivo\" non deve essere vuoto!",
    "Symbol '.' not allowed in 'Device state name'": "Simbolo '.' non consentito in \"Nome stato dispositivo\"",
    "Device name (Viessmann)": "Nome del dispositivo (Viessmann)",
    "Device state name": "Nome dello stato del dispositivo",
    "Device ECU name (fixed)": "Nome ECU del dispositivo (fisso)",
    "Device Address": "Indirizzo del dispositivo",
    "Device ECU address (fixed)": "Indirizzo ECU del dispositivo (fisso)",
    "CAN id for collecting data": "ID CAN per la raccolta dei dati",
    "CAN id - still experimental. Leave blank for deactivation.": "CAN id - ancora sperimentale. Lasciare vuoto per la disattivazione.",
    "List of datapoints": "Elenco dei punti dati",
    "Start scan for datapoints of all devices": "Avvia la scansione dei punti dati di tutti i dispositivi",
    "Confirm scan for datapoints": "Conferma la scansione dei punti dati",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "La scansione richiederà fino a 5 minuti. Assicurati che nessun altro client UDSonCAN (ad esempio Open3Eclient.py) sia in esecuzione. Si prega di non chiudere la scheda durante la scansione. Puoi seguire i progressi guardando il Log in una scheda aggiuntiva.",
    "OK": "OK",
    "Cancel": "Annulla",
    "Select device": "Seleziona dispositivo",
    "List of device specific datapoints": "Elenco di punti dati specifici del dispositivo",
    "ID": "ID",
    "Id of datapoint": "ID del punto dati",
    "Length": "Lunghezza",
    "Length of datapoint": "Lunghezza del punto dati",
    "Name": "Nome",
    "Name of datapoint": "Nome del punto dati",
    "Codec": "Codec",
    "Codec used for datapoint": "Codec utilizzato per il punto dati",
    "Assignments to External CAN Adapter": "Assegnazioni all'adattatore CAN esterno",
    "Energy Meter E380": "Contatore di energia E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "ATTENZIONE: valori inferiori a 2 secondi possono causare un carico pesante del sistema!",
    "Activate communication": "Attiva la comunicazione",
    "This text will be used as base for object tree": "Questo testo verrà utilizzato come base per l'albero degli oggetti",
    "Min. update time (s)": "minimo tempo di aggiornamento (s)",
    "Minumum update time for states. 0 for immediate update.": "Tempo minimo di aggiornamento per gli stati. 0 per aggiornamento immediato.",
    "Collecting Data on External CAN Adapter": "Raccolta dei dati sull'adattatore CAN esterno",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Ascoltare i dati sugli indirizzi forniti in questa tabella. Nessuna scrittura sul bus CAN. Premi \"+\" per iniziare.",
    "No device for collecting available (missing CAN ID).": "Nessun dispositivo per il ritiro disponibile (ID CAN mancante).",
    "ERROR: column 'Device state name' must contain unique text.": "ERRORE: la colonna \"Nome stato dispositivo\" deve contenere testo univoco.",
    "active": "attivo",
    "Requesting data on external CAN Adapter via UDSonCAN": "Richiesta di dati sull'adattatore CAN esterno tramite UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Specifica le pianificazioni per i dispositivi, premi \"+\" per iniziare.",
    "Schedule (s)": "Orari)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Pianificazione per la richiesta di determinati datapoint. 0 per una richiesta una tantum all'avvio dell'istanza dell'adattatore.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Separati con una virgola! Tutti i punti dati forniti verranno richiesti con il programma e l'indirizzo ECU specificati.",
    "Assignments to Internal CAN Adapter": "Assegnazioni all'adattatore CAN interno",
    "Collecting Data on Internal CAN Adapter": "Raccolta dati sull'adattatore CAN interno",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Ascoltare i dati sugli indirizzi forniti in questa tabella. Nessuna scrittura sul bus CAN.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Dispositivi per la raccolta dei dati. Nessuna scrittura sul bus CAN. Premi \"+\" per aggiungere il dispositivo.",
    "Update list of datapoints": "Aggiorna l'elenco dei punti dati",
    "Start scan to update list of devices": "Avvia la scansione per aggiornare l'elenco dei dispositivi",
    "Description": "Descrizione",
    "Optional description of this schedule.": "Descrizione facoltativa di questa pianificazione."
}
