{
    "CAN Adapter": "Adaptateur CAN",
    "Please start this adapter instance to enable further configuration options.": "Veuillez démarrer cette instance d'adaptateur pour activer d'autres options de configuration.",
    "Please press button 'Save', when you're done on this tab.": "Veuillez appuyer sur le bouton « Enregistrer » lorsque vous avez terminé sur cet onglet.",
    "External CAN Adapter": "Adaptateur CAN externe",
    "Device mame of CAN adapter connected to external bus, e.g. can0": "Appareil mame de l'adaptateur CAN connecté au bus externe, par ex. peut0",
    "Connect to Adapter": "Se connecter à l'adaptateur",
    "Internal CAN Adapter": "Adaptateur CAN interne",
    "Device mame of CAN adapter connected to internal bus, e.g. can1": "Appareil mame de l'adaptateur CAN connecté au bus interne, par ex. peut1",
    "List of UDS devices": "Liste des appareils UDS",
    "List of available devices": "Liste des appareils disponibles",
    "Configuration requires a running adapter instance!": "La configuration nécessite une instance d'adaptateur en cours d'exécution !",
    "You may edit 2nd column to set name of state for the device (visible in object tree).": "Vous pouvez modifier la 2ème colonne pour définir le nom de l'état du périphérique (visible dans l'arborescence des objets).",
    "UDS device scan is ongoing. This may take up to 20 seconds.": "L'analyse des appareils UDS est en cours. Cela peut prendre jusqu'à 20 secondes.",
    "'Device state name' must not be blank!": "« Nom de l'état de l'appareil » ne doit pas être vide !",
    "Symbol '.' not allowed in 'Device state name'": "Symbole '.' non autorisé dans « Nom de l'état de l'appareil »",
    "Device name (Viessmann)": "Nom de l'appareil (Viessmann)",
    "Device state name": "Nom de l'état de l'appareil",
    "Device ECU name (fixed)": "Nom de l'ECU de l'appareil (fixe)",
    "Device Address": "Adresse de l'appareil",
    "Device ECU address (fixed)": "Adresse ECU de l'appareil (fixe)",
    "CAN id for collecting data": "ID CAN pour la collecte de données",
    "CAN id - still experimental. Leave blank for deactivation.": "CAN id - encore expérimental. Laissez vide pour la désactivation.",
    "List of datapoints": "Liste des points de données",
    "Start scan for datapoints of all devices": "Démarrer l'analyse des points de données de tous les appareils",
    "Confirm scan for datapoints": "Confirmer l'analyse des points de données",
    "Scan will take up to 5 minutes. Plaese make sure, no other UDSonCAN client (e.g. Open3Eclient.py) is running. Please do not close the tab during scan. You may follow up the progress by watching the Log in an additional tab.": "L'analyse prendra jusqu'à 5 minutes. Assurez-vous qu'aucun autre client UDSonCAN (par exemple Open3Eclient.py) n'est en cours d'exécution. Veuillez ne pas fermer l'onglet pendant l'analyse. Vous pouvez suivre la progression en regardant le journal dans un onglet supplémentaire.",
    "OK": "D'ACCORD",
    "Cancel": "Annuler",
    "Select device": "Choisir un appareil",
    "List of device specific datapoints": "Liste des points de données spécifiques à l'appareil",
    "ID": "IDENTIFIANT",
    "Id of datapoint": "Identifiant du point de données",
    "Length": "Longueur",
    "Length of datapoint": "Longueur du point de données",
    "Name": "Nom",
    "Name of datapoint": "Nom du point de données",
    "Codec": "Codec",
    "Codec used for datapoint": "Codec utilisé pour le point de données",
    "Assignments to External CAN Adapter": "Affectations à l'adaptateur CAN externe",
    "Energy Meter E380": "Compteur d'énergie E380",
    "WARNING: Values below 2 seconds may cause heavy system load!": "AVERTISSEMENT : des valeurs inférieures à 2 secondes peuvent entraîner une charge importante du système !",
    "Activate communication": "Activer la communication",
    "This text will be used as base for object tree": "Ce texte servira de base à l'arborescence des objets",
    "Min. update time (s)": "Min. temps de mise à jour",
    "Minumum update time for states. 0 for immediate update.": "Temps de mise à jour minimum pour les états. 0 pour une mise à jour immédiate.",
    "Collecting Data on External CAN Adapter": "Collecte de données sur un adaptateur CAN externe",
    "Listen for data on addresses given in this table. No writing to CAN bus. Press '+' to begin.": "Écoutez les données sur les adresses indiquées dans ce tableau. Pas d'écriture sur le bus CAN. Appuyez sur « + » pour commencer.",
    "No device for collecting available (missing CAN ID).": "Aucun dispositif de collecte disponible (CAN ID manquant).",
    "ERROR: column 'Device state name' must contain unique text.": "ERREUR : la colonne « Nom de l'état du périphérique » doit contenir un texte unique.",
    "active": "actif",
    "Requesting data on external CAN Adapter via UDSonCAN": "Demande de données sur un adaptateur CAN externe via UDSonCAN",
    "Specify schedules for devices, press '+' to begin.": "Spécifiez les horaires des appareils, appuyez sur « + » pour commencer.",
    "Schedule (s)": "Des horaires)",
    "Schedule for requesting given datapoints. 0 for one time request on start of adapter instance.": "Calendrier de demande de points de données donnés. 0 pour une requête unique au démarrage de l’instance d’adaptateur.",
    "Separate by comma! All given datapoints will be requested with specified schedule and ECU address.": "Séparez par une virgule ! Tous les points de données donnés seront demandés avec un calendrier et une adresse ECU spécifiés.",
    "Assignments to Internal CAN Adapter": "Affectations à l'adaptateur CAN interne",
    "Collecting Data on Internal CAN Adapter": "Collecte de données sur l'adaptateur CAN interne",
    "Listen for data on addresses given in this table. No writing to CAN bus.": "Écoutez les données sur les adresses indiquées dans ce tableau. Pas d'écriture sur le bus CAN.",
    "Devices for collecting data. No writing to CAN bus. Press '+' to add device.": "Appareils de collecte de données. Pas d'écriture sur le bus CAN. Appuyez sur « + » pour ajouter un appareil.",
    "Update list of datapoints": "Mettre à jour la liste des points de données",
    "Start scan to update list of devices": "Démarrer l'analyse pour mettre à jour la liste des appareils",
    "Description": "Description",
    "Optional description of this schedule.": "Description facultative de cet horaire.",
    "Energy Meters": "Compteurs d'énergie",
    "UDS CAN Adapter": "Adaptateur CAN UDS",
    "Device mame of CAN adapter connected to UDS-capable bus, e.g. can0": "Type d'appareil de l'adaptateur CAN connecté au bus compatible UDS, par ex. peut0",
    "Assignments to UDS CAN Adapter": "Affectations à l'adaptateur CAN UDS",
    "Collecting Data on UDS CAN Adapter": "Collecte de données sur l'adaptateur UDS CAN",
    "Requesting data on UDS CAN Adapter via UDSonCAN": "Demande de données sur l'adaptateur UDS CAN via UDSonCAN",
    "Second CAN Adapter": "Deuxième adaptateur CAN",
    "Device mame of CAN adapter connected to second bus, e.g. can1": "Appareil mame de l'adaptateur CAN connecté au deuxième bus, par ex. peut1",
    "Assignments to second CAN Adapter": "Affectations au deuxième adaptateur CAN",
    "Collecting Data on second CAN Adapter": "Collecte de données sur le deuxième adaptateur CAN"
}
